PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog.h
/***************************************************************************//**
* \file cy_autanalog.h
* \version 2.0
*
* Provides an API declaration of the Autonomous Analog driver.
*
********************************************************************************
* \copyright
* Copyright 2022-2025 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_autanalog AUTONOMOUS ANALOG (Autonomous Analog Block)
* \{
* This driver provides API functions to configure the Autonomous Analog.
*
* The Autonomous Analog can sense a voltage or current, convert it to digital code,
* post process conversion data, and thus make the first-level decisions as close to the sensor as possible.
*
* It is a low power reconfigurable mixed signal sense, condition, and respond system,
* which can be fully functional and autonomous in all power modes except Hibernate
* (see \ref group_syspm_power_modes chapter for the device).
*
* The Autonomous Analog is entirely controlled and determined by a Finite-State Machine sequencer,
* (see \ref group_autanalog_ac for more details) which works of a State Transition Table
* (see \ref cy_stc_autanalog_stt_t for more details), to transition appropriately through various
* pre-defined states, based on the Timer and/or Events.
*
* The following diagram shows the subsystems of the Autonomous Analog.
* See the device datasheet for the exact location of pins.
*
* \image html LPPASS_General.png
*
* \section group_autanalog_glossary Glossary
* * AC    - Autonomous Controller, the state machine engine for the Autonomous Analog
* * API   - Application Programming Interface
* * EOS   - End Of Scan
* * FIR   - Finite Impulse Response digital filter
* * FSM   - Finite State Machine
* * GPIO  - General Purpose Input/Output
* * HS    - High Speed operating mode of the Autonomous Analog
* * LP    - Low Power operating mode of the Autonomous Analog
* * LPOSC - Local Low Power Oscillator
* * LSB   - Least Significant Bit
* * LUT   - Look Up Table
* * MMIO  - Memory Mapped Input/Output register
* * MUX   - Multiplexer
* * MSB   - Most Significant Bit
* * OPAMP - Operational Amplifier
* * PGA   - Programmable Gain Amplifier
* * PRB   - Programmable Reference, defines reference level of the voltage
* * SAR   - Successive Approximation Register
* * S/H   - Sample and Hold mode
* * SRSS  - System Resource Subsystem
* * STT   - State Transition Table, the table of state machine states for the Autonomous Analog,
*           essentially, the 'program' for the AC (for more details, see \ref cy_stc_autanalog_stt_t)
* * TIA   - Trans-impedance Amplifier
* * TRM   - Technical Reference Manual
* * TC    - Timer/Counter, the sub-block of the AC
* * VBGR  - Temperature-independent, band-gap voltage reference, used for e.g. PRB
* * VDDA  - Supplies voltage for all analog peripherals and analog core regulators in the device
* * Vref  - Reference Voltage
*
* \section group_autanalog_external_clocks SRSS Clocks
*
* The Autonomous Analog can use the following externally supplied clocks:
* * SRSS peripheral clock Clk_HF9 in chip Active mode using Peri 0 Clock Group 2 8-bit divider in the clock chain,\n
*   refer to the \ref group_autanalog_ac_mode chapter for AC\n
* * SRSS low frequency clock CLK_LF 32kHz used for AC wake-up Timer,\n
*   refer to the AC wake-up Timer configuration structure \ref cy_stc_autanalog_timer_t
*
*    \note The maximum clock frequency for Autonomous Analog is 80MHz
*
* \section group_autanalog_external_Vref External Vref
*
* The Autonomous Analog can use a locally generated Vref (refer to the PRB configuration structure \ref cy_stc_autanalog_prb_cfg_t) or\n
* a Vref supplied externally via the pin (refer to \ref group_autanalog_sar_vref chapter for SAR ADC)

*    \note The maximum level of the external Vref must not exceed the supply voltage for Autonomous Analog, which is 1.8V
*
* \section group_autanalog_section_configuration General Configuration Considerations
*
* \subsection group_autanalog_section_configuration_personalities Use ModusToolbox Device Configurator Tool to generate initialization code
* The steps to generate initialization code using the ModusToolbox Device Configurator:
* 1. Launch the ModusToolbox Device Configurator.
* 2. Enable the Autonomous Analog under the Analog category.
* 3. Select the clock source for the Autonomous Analog according to the intended operating mode\n
*    (refer to \ref group_autanalog_ac_mode chapter for AC) and set the clock divider value to achieve the desired clock rate.
* 4. Preserve the use of the appropriate pins for the required subsystems of the Autonomous Analog.
* 5. Enable the control of the \ref group_autanalog_ac_dout (if required).
* 6. Enable AC \ref group_autanalog_ac_out_trigg (if required).
* 7. Enable AC \ref group_autanalog_ac_in_trigg (if required).
* 8. Enable and configure \ref group_autanalog_ac
*    \note The AC first sate must be set to "Wait Blocks Ready",\n
*    (refer to configuration structure \ref cy_en_autanalog_stt_ac_condition_t)
*    when using subsystems other than AC.
* 9. Enable and configure other required subsystems:\n
*       \ref group_autanalog_ctb;\n
*       \ref group_autanalog_ptcomp;\n
*       \ref group_autanalog_dac;\n
*       \ref group_autanalog_sar;\n
*       \ref group_autanalog_fifo;\n
*
* \section group_autanalog_section_more_information More Information
*
* For more information on the Autonomous Analog,
* refer to the device Architecture Technical Reference Manual (TRM).
*
* \section group_autanalog_changelog Changelog
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td>1.0</td>
*     <td>Initial version</td>
*     <td></td>
*   </tr>
*   <tr>
*     <td rowspan="5">2.0</td>
*     <td>Change interface and update \ref Cy_AutAnalog_SAR_CountsTo_degreeC;</td>
*     <td>Remove the reference voltage from the parameter list.</td>
*   </tr>
*   <tr>
*     <td>Extend type \ref cy_en_autanalog_dac_ref_buf_pwr_t with new option.</td>
*     <td>Introduce new operational mode for CT DAC reference buffer.</td>
*   </tr>
*   <tr>
*     <td>
*        Add new APIs \ref Cy_AutAnalog_FIFO_SetInterruptMask and \ref Cy_AutAnalog_ClearInterruptMask;\n
*        Add new API \ref Cy_AutAnalog_FIFO_ReadAllData based on existing \ref Cy_AutAnalog_FIFO_ReadData;\n
*        Extend interface for \ref Cy_AutAnalog_FIFO_ReadData with an extra parameter that reads the given number of words;\n
*     </td>
*     <td>Improve FIFO API usability.</td>
*   </tr>
*   <tr>
*     <td>Renaming the CTB macros.</td>
*     <td>API enhancement.</td>
*   </tr>
*   <tr>
*     <td>Minor documentation updates.</td>
*     <td>Documentation enhancement.</td>
*   </tr>
* </table>
*
* \defgroup group_autanalog_ac     AC      (Autonomous Controller)
* \defgroup group_autanalog_ctb    CTB     (Continuous Time Block)
* \defgroup group_autanalog_ptcomp PTComp  (Programmable Threshold Comparator)
* \defgroup group_autanalog_dac    CT DAC  (Continuous Time Digital to Analog Converter)
* \defgroup group_autanalog_sar    SAR ADC (Successive-Approximation Register Analog to Digital Converter)
* \defgroup group_autanalog_fifo   FIFO    (The buffer block to store collected data)
* \defgroup group_autanalog_gen    General section of the API
* \{
*   \defgroup group_autanalog_macros Macros
*   \defgroup group_autanalog_functions Functions
*     \{
*         \defgroup group_autanalog_functions_init Initialization/Deinitialization Functions
*         \defgroup group_autanalog_functions_int Interrupt Functions
*     \}
*   \defgroup group_autanalog_data_structures Data Structures
*   \defgroup group_autanalog_enums Enumerated Types
* \}
*/

