PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog.h
#if !defined(CY_AUTANALOG_H)
#define CY_AUTANALOG_H

#include "cy_autanalog_common.h"
#include "cy_autanalog_ac.h"

#ifdef CY_IP_MXS22LPPASS

#ifdef CY_IP_MXS22LPPASS_CTB
    #include "cy_autanalog_ctb.h"
#endif /* CY_IP_MXS22LPPASS_CTB */

#ifdef CY_IP_MXS22LPPASS_PTC
    #include "cy_autanalog_ptc.h"
#endif /* CY_IP_MXS22LPPASS_PTC */

#ifdef CY_IP_MXS22LPPASS_DAC
    #include "cy_autanalog_dac.h"
#endif /* CY_IP_MXS22LPPASS_DAC */

#ifdef CY_IP_MXS22LPPASS_SAR
    #include "cy_autanalog_sar.h"
#endif /* CY_IP_MXS22LPPASS_SAR */

#if defined(__cplusplus)
extern "C" {
#endif

/** \addtogroup group_autanalog_macros
* \{
*/
/**
 * The number of programmable reference voltage blocks,
 * for more details, refer to the device Architecture Technical Reference Manual.
 */
#define CY_AUTANALOG_PRB_NUM                                     (2U)
/**
 * The number of configurations for priority enabler,
 * for more details, refer to the device Architecture Technical Reference Manual.
 */
#define CY_AUTANALOG_PRIORITY_ENABLER_NUM                        (4U)

/* The set of interrupt masks to configure interrupts within the Autonomous Analog */
#define CY_AUTANALOG_INT_CTB0_COMP0       (LPPASS_MMIO_INTR_CAUSE_CTBL0_COMP0_INT_Msk)     /**< CTB0 COMP0 interrupt */
#define CY_AUTANALOG_INT_CTB0_COMP1       (LPPASS_MMIO_INTR_CAUSE_CTBL0_COMP1_INT_Msk)     /**< CTB0 COMP1 interrupt */
#define CY_AUTANALOG_INT_CTB1_COMP0       (LPPASS_MMIO_INTR_CAUSE_CTBL1_COMP0_INT_Msk)     /**< CTB1 COMP0 interrupt */
#define CY_AUTANALOG_INT_CTB1_COMP1       (LPPASS_MMIO_INTR_CAUSE_CTBL1_COMP1_INT_Msk)     /**< CTB1 COMP1 interrupt */
#define CY_AUTANALOG_INT_PTC0_COMP0       (LPPASS_MMIO_INTR_CAUSE_PTC_COMP0_INT_Msk)       /**< PTC0 COMP0 interrupt */
#define CY_AUTANALOG_INT_PTC0_COMP1       (LPPASS_MMIO_INTR_CAUSE_PTC_COMP1_INT_Msk)       /**< PTC0 COMP1 interrupt */
#define CY_AUTANALOG_INT_PTC0_RANGE0      (LPPASS_MMIO_INTR_CAUSE_PTC_RANGE0_INT_Msk)      /**< PTC0 RANGE0 interrupt */
#define CY_AUTANALOG_INT_PTC0_RANGE1      (LPPASS_MMIO_INTR_CAUSE_PTC_RANGE1_INT_Msk)      /**< PTC0 RANGE1 interrupt */
#define CY_AUTANALOG_INT_DAC0_RANGE0      (LPPASS_MMIO_INTR_CAUSE_DAC0_RANGE0_INT_Msk)     /**< DAC0 RANGE0 interrupt */
#define CY_AUTANALOG_INT_DAC0_RANGE1      (LPPASS_MMIO_INTR_CAUSE_DAC0_RANGE1_INT_Msk)     /**< DAC0 RANGE1 interrupt */
#define CY_AUTANALOG_INT_DAC0_RANGE2      (LPPASS_MMIO_INTR_CAUSE_DAC0_RANGE2_INT_Msk)     /**< DAC0 RANGE2 interrupt */
#define CY_AUTANALOG_INT_DAC0_EPOCH       (LPPASS_MMIO_INTR_CAUSE_DAC0_EPOCH_INT_Msk)      /**< DAC0 EPOCH interrupt */
#define CY_AUTANALOG_INT_DAC0_EMPTY       (LPPASS_MMIO_INTR_CAUSE_DAC0_EMPTY_INT_Msk)      /**< DAC0 EMPTY interrupt */
#define CY_AUTANALOG_INT_DAC1_RANGE0      (LPPASS_MMIO_INTR_CAUSE_DAC1_RANGE0_INT_Msk)     /**< DAC1 RANGE0 interrupt */
#define CY_AUTANALOG_INT_DAC1_RANGE1      (LPPASS_MMIO_INTR_CAUSE_DAC1_RANGE1_INT_Msk)     /**< DAC1 RANGE1 interrupt */
#define CY_AUTANALOG_INT_DAC1_RANGE2      (LPPASS_MMIO_INTR_CAUSE_DAC1_RANGE2_INT_Msk)     /**< DAC1 RANGE2 interrupt */
#define CY_AUTANALOG_INT_DAC1_EPOCH       (LPPASS_MMIO_INTR_CAUSE_DAC1_EPOCH_INT_Msk)      /**< DAC1 EPOCH interrupt */
#define CY_AUTANALOG_INT_DAC1_EMPTY       (LPPASS_MMIO_INTR_CAUSE_DAC1_EMPTY_INT_Msk)      /**< DAC1 EMPTY interrupt */
#define CY_AUTANALOG_INT_SAR0_DONE        (LPPASS_MMIO_INTR_CAUSE_SAR_DONE_INT_Msk)        /**< SAR0 DONE interrupt */
#define CY_AUTANALOG_INT_SAR0_EOS         (LPPASS_MMIO_INTR_CAUSE_SAR_EOS_INT_Msk)         /**< SAR0 EOS interrupt */
#define CY_AUTANALOG_INT_SAR0_RESULT      (LPPASS_MMIO_INTR_CAUSE_SAR_RESULT_INT_Msk)      /**< SAR0 RESULT interrupt */
#define CY_AUTANALOG_INT_SAR0_RANGE0      (LPPASS_MMIO_INTR_CAUSE_SAR_RANGE0_INT_Msk)      /**< SAR0 RANGE0 interrupt */
#define CY_AUTANALOG_INT_SAR0_RANGE1      (LPPASS_MMIO_INTR_CAUSE_SAR_RANGE1_INT_Msk)      /**< SAR0 RANGE1 interrupt */
#define CY_AUTANALOG_INT_SAR0_RANGE2      (LPPASS_MMIO_INTR_CAUSE_SAR_RANGE2_INT_Msk)      /**< SAR0 RANGE2 interrupt */
#define CY_AUTANALOG_INT_SAR0_RANGE3      (LPPASS_MMIO_INTR_CAUSE_SAR_RANGE3_INT_Msk)      /**< SAR0 RANGE3 interrupt */
#define CY_AUTANALOG_INT_SAR0_FIR0_RESULT (LPPASS_MMIO_INTR_CAUSE_SAR_FIR0_RESULT_INT_Msk) /**< SAR0 FIR0 RESULT interrupt */
#define CY_AUTANALOG_INT_SAR0_FIR1_RESULT (LPPASS_MMIO_INTR_CAUSE_SAR_FIR1_RESULT_INT_Msk) /**< SAR0 FIR1 RESULT interrupt */
#define CY_AUTANALOG_INT_AC               (LPPASS_MMIO_INTR_CAUSE_AC_INT_Msk)              /**< AC interrupt */

/** \cond INTERNAL */

/** The combined interrupt mask for all available interrupts within the Autonomous Analog */
#define CY_AUTANALOG_INTR                 (CY_AUTANALOG_INT_CTB0_COMP0       | \
                                           CY_AUTANALOG_INT_CTB0_COMP1       | \
                                           CY_AUTANALOG_INT_CTB1_COMP0       | \
                                           CY_AUTANALOG_INT_CTB1_COMP1       | \
                                           CY_AUTANALOG_INT_PTC0_COMP0       | \
                                           CY_AUTANALOG_INT_PTC0_COMP1       | \
                                           CY_AUTANALOG_INT_PTC0_RANGE0      | \
                                           CY_AUTANALOG_INT_PTC0_RANGE1      | \
                                           CY_AUTANALOG_INT_DAC0_RANGE0      | \
                                           CY_AUTANALOG_INT_DAC0_RANGE1      | \
                                           CY_AUTANALOG_INT_DAC0_RANGE2      | \
                                           CY_AUTANALOG_INT_DAC0_EPOCH       | \
                                           CY_AUTANALOG_INT_DAC0_EMPTY       | \
                                           CY_AUTANALOG_INT_DAC1_RANGE0      | \
                                           CY_AUTANALOG_INT_DAC1_RANGE1      | \
                                           CY_AUTANALOG_INT_DAC1_RANGE2      | \
                                           CY_AUTANALOG_INT_DAC1_EPOCH       | \
                                           CY_AUTANALOG_INT_DAC1_EMPTY       | \
                                           CY_AUTANALOG_INT_SAR0_DONE        | \
                                           CY_AUTANALOG_INT_SAR0_EOS         | \
                                           CY_AUTANALOG_INT_SAR0_RESULT      | \
                                           CY_AUTANALOG_INT_SAR0_RANGE0      | \
                                           CY_AUTANALOG_INT_SAR0_RANGE1      | \
                                           CY_AUTANALOG_INT_SAR0_RANGE2      | \
                                           CY_AUTANALOG_INT_SAR0_RANGE3      | \
                                           CY_AUTANALOG_INT_SAR0_FIR0_RESULT | \
                                           CY_AUTANALOG_INT_SAR0_FIR1_RESULT | \
                                           CY_AUTANALOG_INT_AC)

/* Helper macro for validation of the subsystem ID within the Autonomous Analog */
#define CY_AUTANALOG_SUBSYSTEM_ID(value)   ((value) <= CY_AUTANALOG_SAR)
/* Helper macro to validate configured interrupts */
#define CY_AUTANALOG_INTR_MASK(interrupt)  (0UL == ((interrupt) & ~CY_AUTANALOG_INTR))

/** \endcond */

/** \} group_autanalog_macros */

