PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog.h
/***************************************
*       Enumerated Types
***************************************/

/**
* \addtogroup group_autanalog_enums
* \{
*/

/**
 * Select the source voltage for the PRB (Vsrc),
 * for more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_PRB_VBGR = 0UL, /**< The reference is derived from VBGR, the nominal value of Vsrc is 0.9V */
    CY_AUTANALOG_PRB_VDDA = 1UL  /**< The reference is derived from VDDA, the maximum value of Vsrc is 1.8V */

} cy_en_autanalog_prb_src_t;


/**
 * The position of the TAP to select the required Vref from the PRB,
 * the actual value of the Vref depends on the source voltage for PRB (Vsrc), see \ref cy_en_autanalog_prb_src_t.
 * For more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_PRB_TAP_0  = 0UL,  /**< Vref = 0.06 * Vsrc */
    CY_AUTANALOG_PRB_TAP_1  = 1UL,  /**< Vref = 0.13 * Vsrc */
    CY_AUTANALOG_PRB_TAP_2  = 2UL,  /**< Vref = 0.19 * Vsrc */
    CY_AUTANALOG_PRB_TAP_3  = 3UL,  /**< Vref = 0.25 * Vsrc */
    CY_AUTANALOG_PRB_TAP_4  = 4UL,  /**< Vref = 0.31 * Vsrc */
    CY_AUTANALOG_PRB_TAP_5  = 5UL,  /**< Vref = 0.38 * Vsrc */
    CY_AUTANALOG_PRB_TAP_6  = 6UL,  /**< Vref = 0.44 * Vsrc */
    CY_AUTANALOG_PRB_TAP_7  = 7UL,  /**< Vref = 0.50 * Vsrc */
    CY_AUTANALOG_PRB_TAP_8  = 8UL,  /**< Vref = 0.56 * Vsrc */
    CY_AUTANALOG_PRB_TAP_9  = 9UL,  /**< Vref = 0.63 * Vsrc */
    CY_AUTANALOG_PRB_TAP_10 = 10UL, /**< Vref = 0.69 * Vsrc */
    CY_AUTANALOG_PRB_TAP_11 = 11UL, /**< Vref = 0.75 * Vsrc */
    CY_AUTANALOG_PRB_TAP_12 = 12UL, /**< Vref = 0.81 * Vsrc */
    CY_AUTANALOG_PRB_TAP_13 = 13UL, /**< Vref = 0.88 * Vsrc */
    CY_AUTANALOG_PRB_TAP_14 = 14UL, /**< Vref = 0.94 * Vsrc */
    CY_AUTANALOG_PRB_TAP_15 = 15UL, /**< Vref = 1.00 * Vsrc */

} cy_en_autanalog_prb_tap_t;

/** \cond INTERNAL */

/**
 * Default values for start-up/settling delay counters
 */
typedef enum
{
    CY_AUTANALOG_PRIORITY_GROUP0_CNT = 11U, /**< 3uS */
    CY_AUTANALOG_PRIORITY_GROUP1_CNT = 7U,  /**< 2uS */
    CY_AUTANALOG_PRIORITY_GROUP2_CNT = 19U, /**< 5uS */
    CY_AUTANALOG_PRIORITY_GROUP3_CNT = 39U, /**< 10uS */

} cy_en_autanalog_priority_group_counter_t;

/** \endcond */

/** \} group_autanalog_enums */

/***************************************
*       Configuration Structures
***************************************/

/**
* \addtogroup group_autanalog_data_structures
* \{
*/

/** The configuration structure for the PRB,
 *  used in \ref cy_stc_autanalog_prb_t
 */
typedef struct
{
    bool                      enable; /**< Enable the PRB Vref control */
    cy_en_autanalog_prb_src_t src;    /**< The selector of the source voltage for PRB */
    cy_en_autanalog_prb_tap_t tap;    /**< Selector of the tap for the required Vref from PRB */

} cy_stc_autanalog_prb_cfg_t;


/** The high-level configuration structure for the infrastructure of the Autonomous Analog,
 *  used in \ref Cy_AutAnalog_PRB_LoadConfig.
 */
typedef struct
{
    /** PRB */
    cy_stc_autanalog_prb_cfg_t   *prb[CY_AUTANALOG_PRB_NUM]; /**< The configuration structure for the PRB */

} cy_stc_autanalog_prb_t;


/** The PRB section in the State Transition Table state,
 *  used in \ref cy_stc_autanalog_stt_t.
 *  For more details, refer to the device Architecture Technical Reference Manual.
 */
typedef struct
{
    bool                      unlock;      /**< PRB Unlock:\n
                                            * FALSE - Locked:\n
                                            *    Data from fields prbVrefxFw and prbVrefxTap
                                            *    will NOT be taken into account in
                                            *    the corresponding state of STT\n
                                            * TRUE - Unlocked:\n
                                            *    Data from fields prbVrefxFw and prbVrefxTap
                                            *    will be used in the STT corresponding state
                                            */
    /** PRB Vref0 */
    bool                      prbVref0Fw;  /**< The control of PRB Vref0 from the firmware,
                                            *   Vref0 must be enabled in \ref cy_stc_autanalog_prb_cfg_t\n
                                            * FALSE - the PRB output determined by the field prbVref0Tap in this structure\n
                                            * TRUE  - the PRB output determined by the tap field, defined in
                                            *        \ref cy_stc_autanalog_prb_cfg_t
                                            */
    cy_en_autanalog_prb_tap_t prbVref0Tap; /**< The tap selector for the required Vref0 */

    /** PRB Vref1 */
    bool                      prbVref1Fw;  /**< The control of PRB Vref0 from the firmware,
                                            *   Vref1 must be enabled in \ref cy_stc_autanalog_prb_cfg_t\n
                                            * FALSE - the PRB output determined by the field prbVref1Tap in this structure\n
                                            * TRUE  - the PRB output determined by the tap field, defined in
                                            *        \ref cy_stc_autanalog_prb_cfg_t
                                            */
    cy_en_autanalog_prb_tap_t prbVref1Tap; /**< The tap selector for the required Vref1 */

} cy_stc_autanalog_stt_prb_t;


/**
 * The configuration structure to set up the entire Autonomous Analog
 * used with \ref cy_stc_autanalog_t and \ref Cy_AutAnalog_LoadConfig.
 * For more details, refer to the device Architecture Technical Reference Manual.
 */
typedef struct
{
    cy_stc_autanalog_prb_t     *prb;                  /**< The pointer to the PRB configuration */
    cy_stc_autanalog_ac_t      *ac;                   /**< The pointer to the AC configurations */

#ifdef CY_IP_MXS22LPPASS_CTB
    cy_stc_autanalog_ctb_t     *ctb[PASS_NR_CTBLS];   /**< The array of pointers to the CTB subsystem configurations */
#endif /* CTBs */

#ifdef CY_IP_MXS22LPPASS_PTC
    cy_stc_autanalog_ptcomp_t *ptcomp[PASS_NR_PTCS];  /**< The array of pointers to the PTComp subsystem configurations */
#endif /* PTCs */

#ifdef CY_IP_MXS22LPPASS_DAC
    cy_stc_autanalog_dac_t     *dac[PASS_NR_DACS];    /**< The array of pointers to the DAC subsystem configurations */
#endif /* DACs */

#ifdef CY_IP_MXS22LPPASS_SAR
    cy_stc_autanalog_sar_t     *sar[PASS_NR_SARS];    /**< The array of pointers to the SAR subsystem configurations */
#endif /* SARs */

} cy_stc_autanalog_cfg_t;


/**
 * The configuration structure for one row of the State Transition Table,
 * the array of these structures defines the entire State Transition Table.
 * The State Transition Table may have maximum 64 rows.
 * Used in \ref cy_stc_autanalog_t and
 * \ref Cy_AutAnalog_LoadStateTransitionTable, \ref Cy_AutAnalog_UpdateStateTransitionTable.
 * For more details, refer to the device Architecture Technical Reference Manual.
 */
typedef struct
{
    cy_stc_autanalog_stt_ac_t      *ac;                   /**< The pointer to the AC subsystem STT */
    cy_stc_autanalog_stt_prb_t     *prb;                  /**< The pointer to the PRB subsystem STT */

#ifdef CY_IP_MXS22LPPASS_CTB
    cy_stc_autanalog_stt_ctb_t     *ctb[PASS_NR_CTBLS];   /**< The array of pointers to the CTB subsystem STT */
#endif /* CTBs */

#ifdef CY_IP_MXS22LPPASS_PTC
    cy_stc_autanalog_stt_ptcomp_t *ptcomp[PASS_NR_PTCS];  /**< The array of pointers to the PTComp subsystem STT */
#endif /* PTCs*/

#ifdef CY_IP_MXS22LPPASS_DAC
    cy_stc_autanalog_stt_dac_t     *dac[PASS_NR_DACS];    /**< The array of pointers to the DAC subsystem STT */
#endif /* DACs */

#ifdef CY_IP_MXS22LPPASS_SAR
    cy_stc_autanalog_stt_sar_t     *sar[PASS_NR_SARS];    /**< The array of pointers to the SAR subsystem STT */
#endif /* SARs */

} cy_stc_autanalog_stt_t;


/**
 * The configuration and STT data to set up the entire Autonomous Analog,
 * used in \ref Cy_AutAnalog_Init.
 */
typedef struct
{
    cy_stc_autanalog_cfg_t *configuration;         /**< The pointer to the whole configuration structure */
    uint8_t                  numSttEntries;        /**< The number of states in the State Transition Table */
    cy_stc_autanalog_stt_t *stateTransitionTable;  /**< The pointer to the array of the entire State Transition Table */

} cy_stc_autanalog_t;

