PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog.h
/** \} group_autanalog_data_structures */


/***************************************
*        Function Prototypes
***************************************/

/**
* \addtogroup group_autanalog_functions
* \{
*/
__STATIC_INLINE uint32_t Cy_AutAnalog_GetInterruptCause(void);
__STATIC_INLINE uint32_t Cy_AutAnalog_GetInterruptStatus(void);
__STATIC_INLINE void     Cy_AutAnalog_ClearInterrupt(uint32_t interrupt);
__STATIC_INLINE void     Cy_AutAnalog_SetInterrupt(uint32_t interrupt);
__STATIC_INLINE void     Cy_AutAnalog_SetInterruptMask(uint32_t mask);
__STATIC_INLINE uint32_t Cy_AutAnalog_GetInterruptMask(void);
__STATIC_INLINE uint32_t Cy_AutAnalog_GetInterruptStatusMasked(void);


/** \cond INTERNAL */

/*******************************************************************************
* Function Name: Cy_AutAnalog_AdvPowerControl
****************************************************************************//**
*
* Advanced power control API for the Autonomous Analog.
*
* \param sleepModeAC
* Controls the digital power supply for the Autonomous Analog when AC is asleep:\n
* - False - keeps the entire Autonomous Analog digital supply powered
* when AC is asleep (i.e. AC ACTION = WAIT_FOR, \ref cy_en_autanalog_stt_ac_action_t and
* AC CONDITION = wake-up source, \ref cy_en_autanalog_stt_ac_condition_t)\n
* - True - powers down the digital supply for the Autonomous Analog
* when AC is asleep (i.e. AC ACTION = WAIT_FOR, AC CONDITION = wake-up source)\n
* \note This option has the following consequences:\n
* - the digital leakage is reduced (all logic on the switched supply is powered off)
* - CTBs, SAR, FIRs and the DACs loose all configuration\n
*   (must be re-configured to be functional again)\n
* - the wake-up time is increased by 3us
*
* \param lpOscDutyCycle
* The LPOSC operation mode, \ref cy_en_autanalog_timer_clk_src_t:\n
* - False - LPOSC is always ON;\n
* - True - the LPOSC duty cycled is based on AC wake-up signal.
*
* \param sarLpCorePowerCycle
* Disable SAR core and Channel Buffers after conversion in Low Power operating mode
* (recommended for use with duty cycle enabled, see lpOscDutyCycle)\n
* - False - SAR core and Channel Buffers always enabled;\n
* - True - SAR core and Channel Buffers are disabled after conversion.
*
*******************************************************************************/
#if !((CY_IP_MXS22LPPASS_VERSION == 1UL) && (CY_IP_MXS22LPPASS_VERSION_MINOR == 0UL))
void Cy_AutAnalog_AdvPowerControl(bool sleepModeAC, bool lpOscDutyCycle, bool sarLpCorePowerCycle);
#else
void Cy_AutAnalog_AdvPowerControl(bool sleepModeAC, bool lpOscDutyCycle);
#endif

/** \endcond */


/**
* \addtogroup group_autanalog_functions_init
* This set of functions is used to Init/Deinit the Autonomous Analog.
* \{
*/

/*******************************************************************************
* Function Name: Cy_AutAnalog_Clear
****************************************************************************//**
*
* Clears the SAR ADC FIFO, the DAC LUT (the entire SRAM) and the State Transition Table,
* but leaves the Autonomous Analog configuration in the MMIO.
*
*******************************************************************************/
void Cy_AutAnalog_Clear(void);


/*******************************************************************************
* Function Name: Cy_AutAnalog_Init
****************************************************************************//**
*
* Initializes the entire Autonomous Analog with the configuration and states provided.
*
* \param cfgAndStates
* The pointer to the structure containing the configuration data and the content of
* the State Transition Table for the entire Autonomous Analog.
**
* \return
* The combined value of all the subsystem statuses, \ref cy_en_autanalog_status_t.
*
*******************************************************************************/
uint32_t Cy_AutAnalog_Init(const cy_stc_autanalog_t * cfgAndStates);


/*******************************************************************************
* Function Name: Cy_AutAnalog_Disable
****************************************************************************//**
*
* Disables the Autonomous Analog and powers down the digital supply to reduce the leakage.
* \note The configuration of the Autonomous Analog in the MMIO,
* the content of the State Transition Table, data in the SAR ADC FIFO, and
* the DAC LUT will be lost.
*
*******************************************************************************/
void Cy_AutAnalog_Disable(void);


/*******************************************************************************
* Function Name: Cy_AutAnalog_Enable
****************************************************************************//**
*
* Enable the Autonomous Analog for operation.
* \note This API does not start the Autonomous Controller,
* use \ref Cy_AutAnalog_StartAutonomousControl for the actual start.
*
*******************************************************************************/
void Cy_AutAnalog_Enable(void);


/*******************************************************************************
* Function Name: Cy_AutAnalog_LoadConfig
****************************************************************************//**
*
* Configures the Autonomous Analog per provided settings.
* \note This function also
* * enables the IP block;
* * configures individual initialization delays for enabled subsystems;
* * loads trimming values for Autonomous Analog;
*
* \param analogCfg
* The pointer to the structure containing configuration data
* for the entire Autonomous Analog.
*
* \return
* The combined value of all the subsystem statuses, \ref cy_en_autanalog_status_t.
*
*******************************************************************************/
uint32_t Cy_AutAnalog_LoadConfig(const cy_stc_autanalog_cfg_t * analogCfg);


/*******************************************************************************
* Function Name: Cy_AutAnalog_LoadStateTransitionTable
****************************************************************************//**
*
* Configures the State Transition Table of the the Autonomous Controller
* per provided settings.
*
* \param numEntries
* Number of entries in the State Transition Table.
*
* \param stateTransitionTable
* The pointer to an array containing configuration data for the entire State Transition Table.
*
* \return
* The combined value of all the subsystem statuses, \ref cy_en_autanalog_status_t.
*
*******************************************************************************/
cy_en_autanalog_status_t Cy_AutAnalog_LoadStateTransitionTable(uint8_t numEntries, const cy_stc_autanalog_stt_t * stateTransitionTable);


