PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog.h
/*******************************************************************************
* Function Name: Cy_AutAnalog_UpdateStateTransitionTable
****************************************************************************//**
*
* Add or replace states in the State Transition Table.
*
* \param numEntries
* The number of entries in the State Transition Table for add/replace.
*
* \param stateTransitionTable
* The pointer to an array containing a new set of configuration data for the State Transition Table,
* to be added or replaced.
*
* \param startState
* Defines the state in the State Transition Table from which the content update starts.
*
* \return
* Combined value of all the subsystem statuses, \ref cy_en_autanalog_status_t.
*
*******************************************************************************/
cy_en_autanalog_status_t Cy_AutAnalog_UpdateStateTransitionTable(uint8_t numEntries, const cy_stc_autanalog_stt_t * stateTransitionTable, uint8_t startState);


/*******************************************************************************
* Function Name: Cy_AutAnalog_PRB_LoadConfig
****************************************************************************//**
*
* Configures the PRB instance per settings in the configuration structure.
*
* \param prbIdx
* Index of the PRB block within the Autonomous Analog infrastructure.
*
* \param prbCfg
* The pointer to a structure containing configuration data
* for the PRB subsystem.
*
* \return
* The status of initialization, \ref cy_en_autanalog_status_t.
*
*******************************************************************************/
cy_en_autanalog_status_t Cy_AutAnalog_PRB_LoadConfig(uint8_t prbIdx, const cy_stc_autanalog_prb_t * prbCfg);


/** \} group_autanalog_functions_init */

/*******************************************************************************
* Function Name: Cy_AutAnalog_PRB_Write
****************************************************************************//**
*
* Immediately updates the PRB output.
* \note Only applicable if firmware mode for Vref is enabled in the State Transition Table,
* \ref cy_stc_autanalog_stt_prb_t::prbVref0Fw, \ref cy_stc_autanalog_stt_prb_t::prbVref1Fw.
*
* \param prbIdx
* The index of the PRB block within the Autonomous Analog infrastructure.
*
* \param tap
* The location of the TAP for the required Vref from the PRB.
*
*******************************************************************************/
void Cy_AutAnalog_PRB_Write(uint8_t prbIdx, cy_en_autanalog_prb_tap_t tap);

/**
* \addtogroup group_autanalog_functions_int
* This set of functions is used to handle general interrupts in the Autonomous Analog.
* \{
*/

/*******************************************************************************
* Function Name: Cy_AutAnalog_GetInterruptCause
****************************************************************************//**
*
* Returns the cause of the interrupt for the Autonomous Analog.
*
* \return
* The mask of the event, which causes an interrupt in the Autonomous Analog.
* See \ref group_autanalog_macros section for defined interrupts in the Autonomous Analog.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_AutAnalog_GetInterruptCause(void)
{
    return AUTANALOG_MMIO_INTR_CAUSE(LPPASS_MMIO_BASE);
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_GetInterruptStatus
****************************************************************************//**
*
* Returns the status of combined Autonomous Analog interrupt requests.
*
* \return
* The combined mask of interrupt requests for the Autonomous Analog.
* See \ref group_autanalog_macros section for defined interrupts in the Autonomous Analog.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_AutAnalog_GetInterruptStatus(void)
{
    return AUTANALOG_MMIO_INTR(LPPASS_MMIO_BASE);
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_ClearInterrupt
****************************************************************************//**
*
* Clears the interrupts for the Autonomous Analog.
*
* \param interrupt
* The mask of the interrupts to be cleared. Each bit of this mask is responsible for
* clearing of the corresponding interrupt in the Autonomous Analog.
* See \ref group_autanalog_macros section for defined interrupts in the Autonomous Analog.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AutAnalog_ClearInterrupt(uint32_t interrupt)
{
    CY_ASSERT_L2(CY_AUTANALOG_INTR_MASK(interrupt));

    AUTANALOG_MMIO_INTR(LPPASS_MMIO_BASE) = CY_AUTANALOG_INTR & interrupt;

    /*
     * This dummy read guarantees that the interrupt will be cleared on return from this function.
     */
    (void) AUTANALOG_MMIO_INTR(LPPASS_MMIO_BASE);
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_SetInterrupt
****************************************************************************//**
*
* Sets a software interrupt request for the Autonomous Analog.
*
* \param interrupt
* The mask of the interrupts to be set. Each bit of this mask is responsible for
* triggering of the corresponding interrupt in the Autonomous Analog.
* See \ref group_autanalog_macros section for defined interrupts in the Autonomous Analog.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AutAnalog_SetInterrupt(uint32_t interrupt)
{
    CY_ASSERT_L2(CY_AUTANALOG_INTR_MASK(interrupt));

    AUTANALOG_MMIO_INTR_SET(LPPASS_MMIO_BASE) = CY_AUTANALOG_INTR & interrupt;
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_SetInterruptMask
****************************************************************************//**
*
* Configures which bits of the interrupt request register will trigger
* an interrupt event in the Autonomous Analog.
*
* \param mask
* The mask of interrupts allowed to be activated. Each bit of this mask
* allows the corresponding interrupt to be triggered in the Autonomous Analog.
* See \ref group_autanalog_macros section for defined interrupts in the Autonomous Analog.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AutAnalog_SetInterruptMask(uint32_t mask)
{
    CY_ASSERT_L2(CY_AUTANALOG_INTR_MASK(mask));

    AUTANALOG_MMIO_INTR_MASK(LPPASS_MMIO_BASE) = CY_AUTANALOG_INTR & mask;
}


