PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog.h
/*******************************************************************************
* Function Name: Cy_AutAnalog_ClearInterruptMask
****************************************************************************//**
*
* Configures which bits of the interrupt request register will be cleared
* in the Autonomous Analog.
*
* \param mask
* The mask for the clearing of the bits of the interrupt request register
* in the Autonomous Analog.
* See \ref group_autanalog_macros section for defined interrupts
* in the Autonomous Analog.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AutAnalog_ClearInterruptMask(uint32_t mask)
{
    CY_ASSERT_L2(CY_AUTANALOG_INTR_MASK(mask));

    AUTANALOG_MMIO_INTR_MASK(LPPASS_MMIO_BASE) &= CY_AUTANALOG_INTR & (~mask);
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_GetInterruptMask
****************************************************************************//**
*
* Returns the interrupt mask. Each bit of this mask represents an interrupt
* that is allowed in the Autonomous Analog.
*
* \return
* The mask of the interrupts that can be activated.
* See \ref group_autanalog_macros section for defined interrupts in the Autonomous Analog.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_AutAnalog_GetInterruptMask(void)
{
    return AUTANALOG_MMIO_INTR_MASK(LPPASS_MMIO_BASE);
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_GetInterruptStatusMasked
****************************************************************************//**
*
* Returns the result of the bitwise AND operation between the
* corresponding interrupt request and mask bits.
* See \ref Cy_AutAnalog_GetInterruptStatus and \ref Cy_AutAnalog_SetInterruptMask.
*
* \return
* The masked status of combined interrupt requests for the Autonomous Analog.
* See \ref group_autanalog_macros section for defined interrupts in the Autonomous Analog.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_AutAnalog_GetInterruptStatusMasked(void)
{
    return AUTANALOG_MMIO_INTR_MASKED(LPPASS_MMIO_BASE);
}

/** \} group_autanalog_functions_int */

/** \} group_autanalog_functions */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXS22LPPASS */

#endif /** !defined(CY_AUTANALOG_H) */

/** \} group_autanalog */

/* [] END OF FILE */
